JavaScript_and_JQuery_Interactive_Frontend_Web_Development/003.Functions_Methods_and_Objects/003.000.Notes.org
** Section 3.4: Returning a Single Value
   - Some functions return data back to the caller
   - For example, if the caller invokes ~getArea~ then it expects the area to be returned so it can use it in some way
   - The ~return~ keyword is used to return a value to the caller
   - For example:

   #+BEGIN_SRC JavaScript
     function calculateArea(width,height) {
       return width * area;
     }

     let area1 = calculateArea(3,5);
     console.log("Area: ", area1);
   #+END_SRC

   - Note that the ~return~ keyword returns the callee to the caller and no subsequent statements would be processed in the function after the ~return~ statement
   - It will return to the point where the caller invoked the function and after the function has returned it will continue execution as normal

** Section 3.5: Returning Multiple Values
   - Recall that arrays in JS can be of multiple data types they do not have to be of the same data type
   - Thus you can use an array to return a single array holding multiple values
   - Although it technically returns "one" value, it can think of it as returning multiple values because the array can store multiple values
   - For example:

   #+BEGIN_SRC JavaScript
     function getSize(width, height, depth) {
       let area = width * height;
       let volume = width * height * depth;
       let sizes [area, volume];
       return sizes;
     }

     let vals = getSize(3, 5, 7);
     let area = vals[0];
     let volume = vals[1]
   #+END_SRC

** Section 3.6: Anonymous Functions & Function Expressions
   - Expressions produce a value
   - If a function is placed where a browser expects to see an expression (e.g., as an argument to a function) then it gets treated as an expression
   - So far we have seen /named functions/ which you give a name to the function which can then be called using its name
   - Since the interpreter always goes through the script before executing, you can call a function before it is declared
   - If you put a function where the interpreter would expect to see an expression then it is treated as an expression known as a function expression
   - In function expressions, the name is usually omitted but function expressions can also have names
   - A function with no name is called an anonymous function
   - So every anonymous function is a function expression but *not* all function expressions are anonymous functions because function expressions can have names
   - For example:

   #+BEGIN_SRC JavaScript
     // Function expression with name
     let val = function area(width, height){
       return width * height;
     }

     // Function expression with no name
     let val2 = function(width, height) {
       return width * height;
     }

     console.log(val(3,2));
     console.log(val2(5,5));
   #+END_SRC

   - What can you do with function expressions that have names?
   - Anonymous functions and named function expressions behave the same
   - With named function expressions you *cannot* access or call the function by name outside of the function itself
   - So what is the point of named function expressions?
   - Named function expressions allow for better debugging because the function's name appear in stack traces and error messages
   - Named function expressions also allow for it to be called within the function so if the function is recursive then you will need a named function expression
   - Plus named function expressions allow for better readability because you can describe the function's task with the name
   - Another thing to note is that although you can call named functions before it is declared for function expressions you cannot do so
   - The function is not processed until the interpreter gets to that statement and then you can only use the function expression after

** Section 3.7: Immediately Invoked Function Expressions
   - Immediately invoked function expressions (IIFE), "iffy", are functions that are not given a name but instead are executed once the interpreter comes across them
   - So instead of storing the function itself so it can be called later, the IIFE will immediately invoke the function and return a value
   - So how do you have function expressions to be invoked immediately?
   - Simple, after the curly braces of the function expression you place the parentheses like a function call and add any arguments to the function because you are basically invoking the function
   - By placing the parentheses and the arguments after the function you are telling the interpreter to call or invoke the function immediately
   - For example:

   #+BEGIN_SRC JavaScript
     let area = function getArea(width, height){
       return width * height;
     } (3, 5);
   #+END_SRC

   - Some developers like to add parentheses around the whole function in order to group the function and ensure the interpreter treats the function as an expression
   - Although the parentheses are not required it can add readability to your code
   - IIFEs are good when you need a task to be run once rather than repeatedly being called
   - IIFEs are also good as arguments to other functions because the argument may be some calculation for example if you have a volume function then you can possibly pass a IIFE that calculates the area first
   - IIFEs are also good to assign values of properties to an object, they are good in event handlers and listeners to perform a task when an event occurs, and it can help prevent conflicts between multiple scripts (if in use) that might use the same variable names
   - Variables declared inside the anonymous functions are effectively protected from variables in other scripts that might have the same name because of scoping (or in this case variables in the function scope)

** Section 3.8: Variable Scope
   - The location where you declare a variable will affect where it can be used within your code
   - If you declare it within a function then it can only be used within that function, this is known as the variable's scope
   - When a variable is created inside a functionusing the ~var~ keyword then it can only be used in that function thus it is called a local variable or function-level variable so it has a local scope or function-level scope
   - When the variable is a local variable it cannot be accessed outside of the function in which it was declared in
   - The interpreter creates local variables when the function is run and removes them as soon as the function has finished its task
   - If you create a variable outside of a function then it can be used anywhere within the script
   - It is called a global variable and it has global scope
   - Global variables are stored in memory for as long as the web page is loaded nto the web browser which means more memory consumed and possible naming conflicts thus local variables are always preferred
   - If you do not use ~var~ then the variable will be treated as a global variable which is considered bad practice

