JavaScript_and_JQuery_Interactive_Frontend_Web_Development/003.Functions_Methods_and_Objects/003.000.Notes.html
<div id="outline-container-orgee72925" class="outline-3">
<h3 id="orgee72925">Section 3.4: Returning a Single Value</h3>
<div class="outline-text-3" id="text-orgee72925">
<ul class="org-ul">
<li>Some functions return data back to the caller</li>
<li>For example, if the caller invokes <code>getArea</code> then it expects the area to be returned so it can use it in some way</li>
<li>The <code>return</code> keyword is used to return a value to the caller</li>
<li>For example:</li>
</ul>

<div class="org-src-container">
<pre class="src src-JavaScript">function calculateArea(width,height) {
  return width * area;
}

let area1 = calculateArea(3,5);
console.log("Area: ", area1);
</pre>
</div>

<ul class="org-ul">
<li>Note that the <code>return</code> keyword returns the callee to the caller and no subsequent statements would be processed in the function after the <code>return</code> statement</li>
<li>It will return to the point where the caller invoked the function and after the function has returned it will continue execution as normal</li>
</ul>
</div>
</div>
<div id="outline-container-orgab06df6" class="outline-3">
<h3 id="orgab06df6">Section 3.5: Returning Multiple Values</h3>
<div class="outline-text-3" id="text-orgab06df6">
<ul class="org-ul">
<li>Recall that arrays in JS can be of multiple data types they do not have to be of the same data type</li>
<li>Thus you can use an array to return a single array holding multiple values</li>
<li>Although it technically returns "one" value, it can think of it as returning multiple values because the array can store multiple values</li>
<li>For example:</li>
</ul>

<div class="org-src-container">
<pre class="src src-JavaScript">function getSize(width, height, depth) {
  let area = width * height;
  let volume = width * height * depth;
  let sizes [area, volume];
  return sizes;
}

let vals = getSize(3, 5, 7);
let area = vals[0];
let volume = vals[1]
</pre>
</div>
</div>
</div>
<div id="outline-container-org53f5c96" class="outline-3">
<h3 id="org53f5c96">Section 3.6: Anonymous Functions &amp; Function Expressions</h3>
<div class="outline-text-3" id="text-org53f5c96">
<ul class="org-ul">
<li>Expressions produce a value</li>
<li>If a function is placed where a browser expects to see an expression (e.g., as an argument to a function) then it gets treated as an expression</li>
<li>So far we have seen <i>named functions</i> which you give a name to the function which can then be called using its name</li>
<li>Since the interpreter always goes through the script before executing, you can call a function before it is declared</li>
<li>If you put a function where the interpreter would expect to see an expression then it is treated as an expression known as a function expression</li>
<li>In function expressions, the name is usually omitted but function expressions can also have names</li>
<li>A function with no name is called an anonymous function</li>
<li>So every anonymous function is a function expression but <b>not</b> all function expressions are anonymous functions because function expressions can have names</li>
<li>For example:</li>
</ul>

<div class="org-src-container">
<pre class="src src-JavaScript">// Function expression with name
let val = function area(width, height){
  return width * height;
}

// Function expression with no name
let val2 = function(width, height) {
  return width * height;
}

console.log(val(3,2));
console.log(val2(5,5));
</pre>
</div>

<ul class="org-ul">
<li>What can you do with function expressions that have names?</li>
<li>Anonymous functions and named function expressions behave the same</li>
<li>With named function expressions you <b>cannot</b> access or call the function by name outside of the function itself</li>
<li>So what is the point of named function expressions?</li>
<li>Named function expressions allow for better debugging because the function's name appear in stack traces and error messages</li>
<li>Named function expressions also allow for it to be called within the function so if the function is recursive then you will need a named function expression</li>
<li>Plus named function expressions allow for better readability because you can describe the function's task with the name</li>
<li>Another thing to note is that although you can call named functions before it is declared for function expressions you cannot do so</li>
<li>The function is not processed until the interpreter gets to that statement and then you can only use the function expression after</li>
</ul>
</div>
</div>
<div id="outline-container-org474b36a" class="outline-3">
<h3 id="org474b36a">Section 3.7: Immediately Invoked Function Expressions</h3>
<div class="outline-text-3" id="text-org474b36a">
<ul class="org-ul">
<li>Immediately invoked function expressions (IIFE), "iffy", are functions that are not given a name but instead are executed once the interpreter comes across them</li>
<li>So instead of storing the function itself so it can be called later, the IIFE will immediately invoke the function and return a value</li>
<li>So how do you have function expressions to be invoked immediately?</li>
<li>Simple, after the curly braces of the function expression you place the parentheses like a function call and add any arguments to the function because you are basically invoking the function</li>
<li>By placing the parentheses and the arguments after the function you are telling the interpreter to call or invoke the function immediately</li>
<li>For example:</li>
</ul>

<div class="org-src-container">
<pre class="src src-JavaScript">let area = function getArea(width, height){
  return width * height;
} (3, 5);
</pre>
</div>

<ul class="org-ul">
<li>Some developers like to add parentheses around the whole function in order to group the function and ensure the interpreter treats the function as an expression</li>
<li>Although the parentheses are not required it can add readability to your code</li>
<li>IIFEs are good when you need a task to be run once rather than repeatedly being called</li>
<li>IIFEs are also good as arguments to other functions because the argument may be some calculation for example if you have a volume function then you can possibly pass a IIFE that calculates the area first</li>
<li>IIFEs are also good to assign values of properties to an object, they are good in event handlers and listeners to perform a task when an event occurs, and it can help prevent conflicts between multiple scripts (if in use) that might use the same variable names</li>
<li>Variables declared inside the anonymous functions are effectively protected from variables in other scripts that might have the same name because of scoping (or in this case variables in the function scope)</li>
</ul>
</div>
</div>
<div id="outline-container-org6b5bcbf" class="outline-3">
<h3 id="org6b5bcbf">Section 3.8: Variable Scope</h3>
<div class="outline-text-3" id="text-org6b5bcbf">
<ul class="org-ul">
<li>The location where you declare a variable will affect where it can be used within your code</li>
<li>If you declare it within a function then it can only be used within that function, this is known as the variable's scope</li>
<li>When a variable is created inside a functionusing the <code>var</code> keyword then it can only be used in that function thus it is called a local variable or function-level variable so it has a local scope or function-level scope</li>
<li>When the variable is a local variable it cannot be accessed outside of the function in which it was declared in</li>
<li>The interpreter creates local variables when the function is run and removes them as soon as the function has finished its task</li>
<li>If you create a variable outside of a function then it can be used anywhere within the script</li>
<li>It is called a global variable and it has global scope</li>
<li>Global variables are stored in memory for as long as the web page is loaded nto the web browser which means more memory consumed and possible naming conflicts thus local variables are always preferred</li>
<li>If you do not use <code>var</code> then the variable will be treated as a global variable which is considered bad practice</li>
</ul>
</div>
</div>
