JavaScript_and_JQuery_Interactive_Frontend_Web_Development/003.Functions_Methods_and_Objects/003.000.Notes.org
** Section 3.9: How Memory & Variables Work
   - Global variables use more memory because the browser has to remember them for as long as the web page using them is loaded
   - Local variables are only remembered during the period of time that a function is being executed
   - Each variable declared takes up memory and the more variables a browser has to remember the more memory your script requires to run and scripts that require a lot of memory can perform slower which in turn makes your web page take longer to respond
   - A variable actually references a value that is stored in memory and the same value can be used with more than one variable (e.g. val1 and val2 might both "hold" 10 but in reality it references the same value 10)
   - Many web pages use multiple JavaScript files written by multiple people so there could be potential naming collisions causing errors for global variables but if the same named variables have a function scope then there should be no conflict which is why using global variables can lead to naming conflicts

** Section 3.10: Objects
   - Objects group together a set of variables and functions to create a model of something you would recongize from the real world (in a object variables and functions take on new names)
   - If a variable is part of an object then it is called a property and if a function is part of an object then it is called a method
   - Methods represent tasks that are associated with the object
   - Object literals are the easiest ways to create objects (there are several ways to create objects)
   - To create an object literal you use curly braces and you create key/value pairs similar to JSON
   - To separate each key from its value you use a colon and to separate each property and method then you use a comma except for the last value
   - You then assign this object literal to a variable and now you can reference this object literal by using the variable
   - The object cannot have two keys with the same name because keys are used to access their corresponding values and the value can be any data type even another object
   - The value of a method is always a function
   - In order for functions to reference properties in the same object you will have to use ~this~ keyword with the dot operator and the name of the property
   - The ~this~ keyword indicates you want to reference the current object and its properties / methods
   - The dot notation can be used with the ~this~ keyword or with the name of the object literal
   - The dot notation allows you to access the properties or methods of an object or you can also access the object's properties using square brackets
   - For example, you use the name of the object, followed by a period, then the name of the property or method for the dot notation such as: ~objectName.val1~ or ~objectName.func()~
   - The dot operator is also known as the member operator and the property or method on the right belongs to the object on the left
   - You can use square brackets to access the properties of an object but not its methods (object name is followed by square brackets and the property name in quotes or variable string inside of the square brackets)
   - Example of an object literal:

   #+BEGIN_SRC JavaScript
     let hotel = {
       name: 'Park'
     }
   #+END_SRC

** Section 3.11: Creating an Object
   - The ~new~ keyword and the "object" constructor creates a blank object which you can then add properties and methods to the object
   - First you create a new object using a combination of the ~new~ keyword and the ~Object()~ constructor function, for example: ~let hotel = new Object()~
   - Then you can add properties and methods to the blank object using dot notation, for example: ~hotel.name = 'Quay';~
   - You can use this syntax to add properties and methods to any object you have created no matter which notation you used to create it
   - To create an empty object using literal notation you can do: ~var hotel = {}~

** Section 3.12: Updating an Object
   - To update the value of properties, use dot notation or square brackets, they work on objects created using literal or constructor notation
   - To delete a property use the ~delete~ keyword
   - Example of updating an object: ~hotel.name = 'New Name';~ or ~hotel['name'] = 'New Name'~ (this only works for properties not functions)
   - If the property you are trying to update it does not exist in the object then it will be added to the object
   - Example of deleting a property: ~delete hotel.name~
   - Example of clearing a property: ~delete hotel.name = ''~

** Section 3.13: Constructor Notation
   - Object constructors can use a function as a template for creating objects
   - You create the template with the object's properties and methods
   - For example:

   #+BEGIN_SRC JavaScript
     function Hotel(name, rooms, booked) {
       this.name = name;
       this.rooms = rooms;
       this.booked = booked;

       this.checkAvailability = function () {
         return this.rooms - this.booked;
       };
     }
   #+END_SRC

   - Then to create an object using the function you run:

   #+BEGIN_SRC JavaScript
     let parkHotel = new Hotel('Park', 120, 77);
   #+END_SRC

   - Two things to notice when creating a function constructor: ~this~ and ~new~
   - ~this~ is used inside the function to refer the object being created
   - ~new~ is used to tell the interpreter you want an object to be created
   - Here is how it works:
     - When you use the ~new~ operator, the interpreter creates a new empty object and sets ~this~ inside the function to refer the newly created object
     - So once it enters the function, ~this~ is referring to the newly created object and now you set the properties and methods
   - What if you don't use ~new~?
   - If you do not use ~new~ then a new object will NOT be created and ~this~ could be referring to the global object (~window~ in browswers) or it could lead to an "undefined" error, this depends which mode are you in non-strict or strict mode
   - If you are in non-strict mode and ~this~ refers to the global object then you may unintentionally create global variables
   - Thus, you always use ~new~ to create a new object
   - ~new~ creates and returns the object for you and the function simply initializes the object for you which automatically is referred to by ~this~ if the ~new~ keyword is used
   - Thus you can invoke the constructor function with the ~new~ keyword as much as you would like creating multiple different objects with the same properties (possibly different values) and methods
   - Each variable / object's name need to be different because then you get naming conflicts

