JavaScript_and_JQuery_Interactive_Frontend_Web_Development/003.Functions_Methods_and_Objects/003.000.Notes.html
<div id="outline-container-org7b9452b" class="outline-3">
<h3 id="org7b9452b">Section 3.9: How Memory &amp; Variables Work</h3>
<div class="outline-text-3" id="text-org7b9452b">
<ul class="org-ul">
<li>Global variables use more memory because the browser has to remember them for as long as the web page using them is loaded</li>
<li>Local variables are only remembered during the period of time that a function is being executed</li>
<li>Each variable declared takes up memory and the more variables a browser has to remember the more memory your script requires to run and scripts that require a lot of memory can perform slower which in turn makes your web page take longer to respond</li>
<li>A variable actually references a value that is stored in memory and the same value can be used with more than one variable (e.g. val1 and val2 might both "hold" 10 but in reality it references the same value 10)</li>
<li>Many web pages use multiple JavaScript files written by multiple people so there could be potential naming collisions causing errors for global variables but if the same named variables have a function scope then there should be no conflict which is why using global variables can lead to naming conflicts</li>
</ul>
</div>
</div>
<div id="outline-container-org8e6dc50" class="outline-3">
<h3 id="org8e6dc50">Section 3.10: Objects</h3>
<div class="outline-text-3" id="text-org8e6dc50">
<ul class="org-ul">
<li>Objects group together a set of variables and functions to create a model of something you would recongize from the real world (in a object variables and functions take on new names)</li>
<li>If a variable is part of an object then it is called a property and if a function is part of an object then it is called a method</li>
<li>Methods represent tasks that are associated with the object</li>
<li>Object literals are the easiest ways to create objects (there are several ways to create objects)</li>
<li>To create an object literal you use curly braces and you create key/value pairs similar to JSON</li>
<li>To separate each key from its value you use a colon and to separate each property and method then you use a comma except for the last value</li>
<li>You then assign this object literal to a variable and now you can reference this object literal by using the variable</li>
<li>The object cannot have two keys with the same name because keys are used to access their corresponding values and the value can be any data type even another object</li>
<li>The value of a method is always a function</li>
<li>In order for functions to reference properties in the same object you will have to use <code>this</code> keyword with the dot operator and the name of the property</li>
<li>The <code>this</code> keyword indicates you want to reference the current object and its properties / methods</li>
<li>The dot notation can be used with the <code>this</code> keyword or with the name of the object literal</li>
<li>The dot notation allows you to access the properties or methods of an object or you can also access the object's properties using square brackets</li>
<li>For example, you use the name of the object, followed by a period, then the name of the property or method for the dot notation such as: <code>objectName.val1</code> or <code>objectName.func()</code></li>
<li>The dot operator is also known as the member operator and the property or method on the right belongs to the object on the left</li>
<li>You can use square brackets to access the properties of an object but not its methods (object name is followed by square brackets and the property name in quotes or variable string inside of the square brackets)</li>
<li>Example of an object literal:</li>
</ul>

<div class="org-src-container">
<pre class="src src-JavaScript">let hotel = {
  name: 'Park'
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org186e316" class="outline-3">
<h3 id="org186e316">Section 3.11: Creating an Object</h3>
<div class="outline-text-3" id="text-org186e316">
<ul class="org-ul">
<li>The <code>new</code> keyword and the "object" constructor creates a blank object which you can then add properties and methods to the object</li>
<li>First you create a new object using a combination of the <code>new</code> keyword and the <code>Object()</code> constructor function, for example: <code>let hotel = new Object()</code></li>
<li>Then you can add properties and methods to the blank object using dot notation, for example: <code>hotel.name = 'Quay';</code></li>
<li>You can use this syntax to add properties and methods to any object you have created no matter which notation you used to create it</li>
<li>To create an empty object using literal notation you can do: <code>var hotel = {}</code></li>
</ul>
</div>
</div>
<div id="outline-container-org57d166a" class="outline-3">
<h3 id="org57d166a">Section 3.12: Updating an Object</h3>
<div class="outline-text-3" id="text-org57d166a">
<ul class="org-ul">
<li>To update the value of properties, use dot notation or square brackets, they work on objects created using literal or constructor notation</li>
<li>To delete a property use the <code>delete</code> keyword</li>
<li>Example of updating an object: <code>hotel.name = 'New Name';</code> or <code>hotel['name'] = 'New Name'</code> (this only works for properties not functions)</li>
<li>If the property you are trying to update it does not exist in the object then it will be added to the object</li>
<li>Example of deleting a property: <code>delete hotel.name</code></li>
<li>Example of clearing a property: <code>delete hotel.name = ''</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgff591aa" class="outline-3">
<h3 id="orgff591aa">Section 3.13: Constructor Notation</h3>
<div class="outline-text-3" id="text-orgff591aa">
<ul class="org-ul">
<li>Object constructors can use a function as a template for creating objects</li>
<li>You create the template with the object's properties and methods</li>
<li>For example:</li>
</ul>

<div class="org-src-container">
<pre class="src src-JavaScript">function Hotel(name, rooms, booked) {
  this.name = name;
  this.rooms = rooms;
  this.booked = booked;

  this.checkAvailability = function () {
    return this.rooms - this.booked;
  };
}
</pre>
</div>

<ul class="org-ul">
<li>Then to create an object using the function you run:</li>
</ul>

<div class="org-src-container">
<pre class="src src-JavaScript">let parkHotel = new Hotel('Park', 120, 77);
</pre>
</div>

<ul class="org-ul">
<li>Two things to notice when creating a function constructor: <code>this</code> and <code>new</code></li>
<li><code>this</code> is used inside the function to refer the object being created</li>
<li><code>new</code> is used to tell the interpreter you want an object to be created</li>
<li>Here is how it works:
<ul class="org-ul">
<li>When you use the <code>new</code> operator, the interpreter creates a new empty object and sets <code>this</code> inside the function to refer the newly created object</li>
<li>So once it enters the function, <code>this</code> is referring to the newly created object and now you set the properties and methods</li>
</ul></li>
<li>What if you don't use <code>new</code>?</li>
<li>If you do not use <code>new</code> then a new object will NOT be created and <code>this</code> could be referring to the global object (<code>window</code> in browswers) or it could lead to an "undefined" error, this depends which mode are you in non-strict or strict mode</li>
<li>If you are in non-strict mode and <code>this</code> refers to the global object then you may unintentionally create global variables</li>
<li>Thus, you always use <code>new</code> to create a new object</li>
<li><code>new</code> creates and returns the object for you and the function simply initializes the object for you which automatically is referred to by <code>this</code> if the <code>new</code> keyword is used</li>
<li>Thus you can invoke the constructor function with the <code>new</code> keyword as much as you would like creating multiple different objects with the same properties (possibly different values) and methods</li>
<li>Each variable / object's name need to be different because then you get naming conflicts</li>
</ul>
</div>
