JavaScript_and_JQuery_Interactive_Frontend_Web_Development/003.Functions_Methods_and_Objects/003.000.Notes.org
*** Section 3.13.1: Classes
    - This book does not go over classes because classes came out after the book in ES6
    - Classes are another way to create templates for objects
    - When creating a class you must also use the ~new~ keyword like the following: ~let obj1 = new ClassName()~
    - Classes are very similar to constructor functions but syntactically it must be invoked with the ~new~ keyword
    - Classes are designed to be invoked only with the ~new~ keyword and without the keyword an error will be thrown
    - To declare properties are very similar to constructor functions but methods are created slightly different
    - [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Classes][More about classes by Mozilla Docs]]

* Keywords

| Term | Definition |
|------+------------|
|      |            |

* Questions
  - *Q*:

* Summary
