JavaScript_and_JQuery_Interactive_Frontend_Web_Development/003.Functions_Methods_and_Objects/003.000.Notes.html
<div id="outline-container-org07f89ee" class="outline-4">
<h4 id="org07f89ee">Section 3.13.1: Classes</h4>
<div class="outline-text-4" id="text-org07f89ee">
<ul class="org-ul">
<li>This book does not go over classes because classes came out after the book in ES6</li>
<li>Classes are another way to create templates for objects</li>
<li>When creating a class you must also use the <code>new</code> keyword like the following: <code>let obj1 = new ClassName()</code></li>
<li>Classes are very similar to constructor functions but syntactically it must be invoked with the <code>new</code> keyword</li>
<li>Classes are designed to be invoked only with the <code>new</code> keyword and without the keyword an error will be thrown</li>
<li>To declare properties are very similar to constructor functions but methods are created slightly different</li>
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Classes">More about classes by Mozilla Docs</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org59c3db5" class="outline-2">
<h2 id="org59c3db5">Keywords</h2>
<div class="outline-text-2" id="text-org59c3db5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0eef066" class="outline-2">
<h2 id="org0eef066">Questions</h2>
<div class="outline-text-2" id="text-org0eef066">
<ul class="org-ul">
<li><b>Q</b>:</li>
</ul>
</div>
</div>
<div id="outline-container-orgd4f3513" class="outline-2">
<h2 id="orgd4f3513">Summary</h2>
</div>
</div>
</body>
</html>
